Repository: saylermedia/luaex
Catalog: i18n/*.po
Languages: ru_ru

source: invalid index
ru_ru: недопустимый индекс

source: index not in the stack
ru_ru: индекс не стеке

source: unacceptable index
ru_ru: недопустимый индекс

source: upvalue index too large
ru_ru: upvalue индекс слишком большой

source: negative 'n'
ru_ru: отрицательный 'n'

source: moving among independent states
ru_ru: перемещение между независимыми состояниями

source: stack overflow
ru_ru: переполнение стека

source: new top too large
ru_ru: новая вершина слишком большая

source: invalid new top
ru_ru: недопустимая новая вершина

source: invalid tag
ru_ru: неверный тег

source: invalid option
ru_ru: недопустимая опция

source: table expected
ru_ru: ожидается таблица

source: full userdata expected
ru_ru: ожидается полная userdata

source: cannot use continuations inside hooks
ru_ru: невозможно использовать продолжения внутри хуков

source: cannot do calls on non-normal thread
ru_ru: невозможно делать вызовы в ненормальном потоке

source: Lua function expected
ru_ru: ожидается функция Lua

source: invalid upvalue index
ru_ru: недопустимый индекс upvalue

source: closure expected
ru_ru: ожидается замыкание

source: not enough elements in the stack
ru_ru: недостаточно элементов в стеке

source: function '%s'
ru_ru: функция '%s'

source: main chunk
ru_ru: главном блоке

source: function <%s:%d>
ru_ru: функция <%s:%d>

source: stack traceback:
ru_ru: стек вызовов:

source: in
ru_ru: в

source: (...tail calls...)
ru_ru: (...последние вызовы...)

source: bad argument #%d (%s)
ru_ru: плохой аргумент #%d (%s)

source: calling '%s' on bad self (%s)
ru_ru: вызов '%s' на плохом объекте (%s)

source: bad argument #%d to '%s' (%s)
ru_ru: плохой аргумент #%d для '%s' (%s)

source: %s expected, got %s
ru_ru: ожидается %s, а не %s

source: invalid option '%s'
ru_ru: недопустимая опция '%s'

source: stack overflow (%s)
ru_ru: переполнение стека (%s)

source: value expected
ru_ru: ожидается значение

source: number has no integer representation
ru_ru: число не имеет никакого целочисленного представления

source: not enough memory for buffer allocation
ru_ru: недостаточно памяти для буфера

source: buffer too large
ru_ru: слишком большой буфер

source: cannot %s %s: %s
ru_ru: невозможно %s %s: %s

source: object length is not an integer
ru_ru: объектная длина не является целым числом

source: '__tostring' must return a string
ru_ru: '__tostring' должна возвратить строку

source: name conflict for module '%s'
ru_ru: конфликт имен для модуля '%s'

source: too many upvalues
ru_ru: слишком много параметров верхнего уровня

source: PANIC: unprotected error in call to Lua API (%s)
ru_ru: PANIC: незащищенная ошибка при вызове Lua API (%s)

source: core and library have incompatible numeric types
ru_ru: ядро и библиотека имеют несовместимые числовые типы

source: multiple Lua VMs detected
ru_ru: обнаружено множественное использование виртуальных машин Lua

source: version mismatch: app. needs %f, Lua core provides %f
ru_ru: несоответствие версии: прил. требуется %f, Lua ядро обеспечивает %f

source: 'tostring' must return a string to 'print'
ru_ru: 'tostring' должна возвратить строку для 'print'

source: base out of range
ru_ru: вне диапазона

source: nil or table expected
ru_ru: ожидается неопределено или таблица

source: cannot change a protected metatable
ru_ru: не может изменить защищенную таблицу метаданных

source: table or string expected
ru_ru: ожидается строка или таблица

source: too many nested functions
ru_ru: слишком много вложенных функций

source: reader function must return a string
ru_ru: функция чтения должна возвратить строку

source: assertion failed!
ru_ru: условное исключение!

source: index out of range
ru_ru: индекс вне диапазона

source: field cannot be negative
ru_ru: поле не может быть отрицательным

source: width must be positive
ru_ru: ширина должна быть положительной

source: trying to access non-existent bits
ru_ru: попытка получить доступ к несуществующим битам

source: library 'bit32' has been deprecated
ru_ru: библиотека 'bit32' устарела

source: control structure too long
ru_ru: управляющая структура слишком длинная

source: function or expression needs too many registers
ru_ru: функция или выражение нуждаются в слишком многих регистрах

source: constructor too long
ru_ru: конструктор слишком длинный

source: thread expected
ru_ru: ожидается поток

source: too many arguments to resume
ru_ru: слишком много параметров для возобновления

source: too many results to resume
ru_ru: слишком много результатов для продолжения

source: level out of range
ru_ru: уровень вне диапазона

source: function expected
ru_ru: ожидается функция

source: attempt to %s a %s value%s
ru_ru: попытка %s a %s значения %s

source: concatenate
ru_ru: конкатенировать

source: number%s has no integer representation
ru_ru: число%s не имеет никакого целочисленного представления

source: attempt to compare two %s values
ru_ru: попытка сравнить два значения %s

source: attempt to compare %s with %s
ru_ru: попытка сравнить %s с %s

source: not enough memory
ru_ru: недостаточно памяти

source: IEEE invalide operation
ru_ru: IEEE недопустимая операция

source: division by zero
ru_ru: деление на нуль

source: overflow
ru_ru: переполнение

source: underflow
ru_ru: потеря значимости

source: subnormal
ru_ru: ниже нормального

source: inexact
ru_ru: неточный

source: rounded
ru_ru: округленный

source: clamped
ru_ru: фиксированный

source: operation failed
ru_ru: ошибка выполнения

source: cannot convert value to decimal
ru_ru: невозможно привести значение к decimal

source: cannot convert type %s to decimal
ru_ru: невозможно привести тип %s к decimal

source: C stack overflow
ru_ru: переполнение стека C

source: attempt to yield across a C-call boundary
ru_ru: попытка уступить через границу C-вызова

source: attempt to yield from outside a coroutine
ru_ru: попытка уступить снаружи сопрограммы

source: hooks cannot continue after yielding
ru_ru: хуки не могут продолжаться после остановки

source: attempt to load a %s chunk (mode is '%s')
ru_ru: попытка загрузить блок %s (в режиме '%s')

source: no message
ru_ru: отсутствует сообщение

source: error in __gc metamethod (%s)
ru_ru: ошибка в __gc метаметода (%s)

source: 'popen' not supported
ru_ru: 'popen' не поддерживается

source: file (closed)
ru_ru: файл (закрыт)

source: file (%p)
ru_ru: файл (%p)

source: attempt to use a closed file
ru_ru: попытка использовать закрытый файл

source: cannot open file '%s' (%s)
ru_ru: невозможно открыть файл '%s' (%s)

source: invalid mode
ru_ru: недопустимый режим

source: standard %s file is closed
ru_ru: стандартный файл %s закрыт

source: too many arguments
ru_ru: слишком много параметров

source: file is already closed
ru_ru: файл уже закрыт

source: not an integer in proper range
ru_ru: не целое число в правильном диапазоне

source: cannot close standard file
ru_ru: невозможно закрыть стандартный файл

source: lexical element too long
ru_ru: лексический элемент слишком долгий

source: %s near %s
ru_ru: %s около %s

source: chunk has too many lines
ru_ru: блок имеет слишком много строк

source: malformed number
ru_ru: некорректное число

source: string
ru_ru: строка

source: comment
ru_ru: комментарий

source: unfinished long %s (starting at line %d)
ru_ru: незаконченная последовательность %s (начиная со строки %d)

source: hexadecimal digit expected
ru_ru: ожидается шестнадцатеричная цифра

source: missing '{'
ru_ru: отсутствует '{'

source: UTF-8 value too large
ru_ru: UTF-8 значение слишком большое

source: missing '}'
ru_ru: отсутствует '}'

source: decimal escape too large
ru_ru: десятичный знак слишком велик

source: unfinished string
ru_ru: незаконченная строка

source: invalid escape sequence
ru_ru: недопустимая escape-последовательность

source: invalid long string delimiter
ru_ru: недопустимый разделитель длинной строки

source: zero
ru_ru: нуль

source: wrong number of arguments
ru_ru: неправильное число параметров

source: interval is empty
ru_ru: пустой интервал

source: interval too large
ru_ru: слишком большой интервал

source: too many %s (limit is %d)
ru_ru: слишком много %s (ограниченно %d)

source: memory allocation error: block too big
ru_ru: ошибка распределения памяти: слишком большой блок

source: unable to get ModuleFileName
ru_ru: невозможно получить ModuleFileName

source: system error %d
ru_ru: системная ошибка %d

source: no file '%s'
ru_ru: отсутствует файл '%s'

source: 'package.%s' must be a string
ru_ru: 'package.%s' должно быть строкой

source: error loading module '%s' from file '%s': %s
ru_ru: ошибка загрузки модуля '%s' из файла '%s': %s

source: no module '%s' in file '%s'
ru_ru: отсутствует модуль '%s' в файле '%s'

source: no field package.preload['%s']
ru_ru: отсутствует в package.preload['%s']

source: 'package.searchers' must be a table
ru_ru: 'package.searchers' должно быть таблицой

source: module '%s' not found:%s
ru_ru: модуль '%s' не найден:%s

source: 'module' not called from a Lua function
ru_ru: 'module' не вызвана из Lua функции

source: invalid option '%%%c' to 'lua_pushfstring'
ru_ru: недопустимая опция '%%%c' для 'lua_pushfstring'

source: time out-of-bounds
ru_ru: время за пределами

source: unable to generate a unique filename
ru_ru: невозможно сгенерировать уникальное имя файла

source: field '%s' is not an integer
ru_ru: поле '%s' не целое число

source: field '%s' missing in date table
ru_ru: поле '%s' отсутствует в таблице даты

source: field '%s' is out-of-bound
ru_ru: поле '%s' не связанное

source: invalid conversion specifier '%%%s'
ru_ru: недопустимый спецификатор преобразования '%%%s'

source: time result cannot be represented in this installation
ru_ru: время не может быть представлено в этой установке

source: %s expected
ru_ru: ожидается %s

source: main function
ru_ru: главной функции

source: function at line %d
ru_ru: функция на строке %d

source: too many %s (limit is %d) in %s
ru_ru: слишком много %s (ограниченно %d) %s

source: %s expected (to close %s at line %d)
ru_ru: ожидается %s (закрыть %s на строке %d)

source: <goto %s> at line %d jumps into the scope of local '%s'
ru_ru: <перейти %s> в строке %d переходит в область локальной '%s'

source: <%s> at line %d not inside a loop
ru_ru: <%s> в строке %d не внутри цикла

source: no visible label '%s' for <goto> at line %d
ru_ru: метка '%s' вне видимости для <goto> в строке %d

source: <name> or '...' expected
ru_ru: ожидается <имя> или '...'

source: function arguments expected
ru_ru: ожидаются аргументы функции

source: unexpected symbol
ru_ru: непредвиденный символ

source: cannot use '...' outside a vararg function
ru_ru: невозможно использовать '...' вне vararg функции

source: syntax error
ru_ru: синтаксическая ошибка

source: label '%s' already defined on line %d
ru_ru: метка '%s' уже определена в строке %d

source: '=' or 'in' expected
ru_ru: ожидается '=' или 'in'

source: expected function, got method
ru_ru: ожидается функция, а не метод

source: expected function
ru_ru: ожидается функция

source: cannot serialize function
ru_ru: невозможно сериализировать функцию

source: cannot serialize %s
ru_ru: невозможно сериализировать %s

source: serialized data malformed, expected '%s'
ru_ru: сериализированные данные неккоректны, ожидается '%s'

source: serialized data break
ru_ru: сериализированное повреждение данных

source: 0 or 1
ru_ru: 0 или 1

source: type '%c' malformed
ru_ru: тип '%c' некорректен

source: resulting string too large
ru_ru: слишком большая результирующая строка

source: string slice too long
ru_ru: строковая часть слишком длинная

source: value out of range
ru_ru: значение вне диапазона

source: unable to dump given function
ru_ru: невозможно вывести данную функцию

source: invalid capture index %%%d
ru_ru: недопустимый индекс %%%d

source: invalid pattern capture
ru_ru: недопустимый шаблон

source: malformed pattern (ends with '%%')
ru_ru: некорректный шаблон (заканчивается на '%%')

source: malformed pattern (missing ']')
ru_ru: некорректный шаблон (отсутствует ']')

source: malformed pattern (missing arguments to '%%b')
ru_ru: некорректный шаблон (отсутствуют аргументы для '%%b')

source: too many captures
ru_ru: слишком много совпадений

source: pattern too complex
ru_ru: шаблон слишком сложный

source: missing '[' after '%%f' in pattern
ru_ru: отсутствует '[' после '%%f' в шаблоне

source: unfinished capture
ru_ru: незаконченное совпадение

source: invalid use of '%c' in replacement string
ru_ru: недопустимо использование '%c' в замещающей строке

source: invalid replacement value (a %s)
ru_ru: недопустимое заменяющее значение (%s)

source: string/function/table expected
ru_ru: ожидается строка/функция/таблица

source: modifiers for format '%%a'/'%%A' not implemented
ru_ru: модификаторы для формата '%%a'/'%%A' не реализованы

source: value has no literal form
ru_ru: значение не имеет никакой литеральной формы

source: invalid format (repeated flags)
ru_ru: недопустимый формат (повторяемые флаги)

source: invalid format (width or precision too long)
ru_ru: недопустимый формат (ширина или точность слишком длинная)

source: no value
ru_ru: отсутствует значение

source: string contains zeros
ru_ru: строка содержит нули

source: invalid option '%%%c' to 'format'
ru_ru: недопустимая опция '%%%c' для 'format'

source: integral size (%d) out of limits [1,%d]
ru_ru: интегральный размер (%d) вне границ [1,%d]

source: missing size for format option 'c'
ru_ru: отсутствует размер для параметра формата 'c'

source: invalid format option '%c'
ru_ru: неверный формат '%c'

source: invalid next option for option 'X'
ru_ru: недопустимая следующая опция для опции 'X'

source: format asks for alignment not power of 2
ru_ru: формат требует выравнивания не по основанию 2

source: integer overflow
ru_ru: целочисленное переполнение

source: unsigned overflow
ru_ru: беззнаковое переполнение

source: string longer than given size
ru_ru: строка длиннее заданного размера

source: string length does not fit in given size
ru_ru: длина строки не подходит для данного размера

source: format result too large
ru_ru: слишком большой результат форматирования

source: variable-length format
ru_ru: формат переменной длины

source: %d-byte integer does not fit into Lua Integer
ru_ru: целое %d-байт не вписывается в целое значение Lua

source: initial position out of string
ru_ru: начальная позиция вне строки

source: data string too short
ru_ru: данные представляют в виде слишком короткой строки

source: too many results
ru_ru: слишком много результатов

source: invalid key to 'next'
ru_ru: недопустимый ключ к 'next'

source: table overflow
ru_ru: таблица переполнена

source: table index is nil
ru_ru: индекс таблицы = неопределено

source: table index is NaN
ru_ru: индекс таблицы = NaN

source: position out of bounds
ru_ru: позиция за пределами

source: wrong number of arguments to 'insert'
ru_ru: неправильное число параметров для 'insert'

source: too many elements to move
ru_ru: слишком много элементов для перемещения

source: destination wrap around
ru_ru: назначение обернуто вокруг

source: invalid value (%s) at index %d in table for 'concat'
ru_ru: недопустимое значение (%s) по индексу %d в таблице для 'concat'

source: too many results to unpack
ru_ru: слишком много результатов для распаковки

source: invalid order function for sorting
ru_ru: недопустимая функция сравнения для упорядочивания

source: array too big
ru_ru: массив слишком большой

source: cannot create state: not enough memory
ru_ru: невозможно создать контекст: недостаточно памяти

source: cannot create thread
ru_ru: невозможно создать поток

source: not implement to main thread
ru_ru: не реализовано для основного потока

source: perform bitwise operation on
ru_ru: выполнить побитовую операцию на

source: perform arithmetic on
ru_ru: выполнять арифметику на

source: interrupted!
ru_ru: прерванный!

source: '%s' needs argument
ru_ru: '%s' необходим аргумент

source: unrecognized option '%s'
ru_ru: нераспознанная опция '%s'

source: usage: %s [options] [script [args]] Available options are: -e stat execute string 'stat' -i enter interactive mode after executing 'script' -l name require library 'name' into global 'name' -v show version information -E ignore environment variables -- stop handling options - stop handling options and execute stdin
ru_ru: Использование: %s [опции] [скрипт [аргументы]] Доступные опции: -e строка выполнить строку -i открыть интерактивный режим после выполнения скрипта -l имя подключить библиотеку 'имя' как глобальную переменную 'имя' -v показать информацию о версии -E игнорировать переменные окружения -- прекратить обрабатывать опции - прекратить обрабатывать опции и обработать стандартный поток ввода

source: too many results to print
ru_ru: слишком много результатов для вывода

source: error calling 'print' (%s)
ru_ru: ошибка вызова 'print' (%s)

source: 'arg' is not a table
ru_ru: 'arg' не является таблицой

source: too many arguments to script
ru_ru: слишком много параметров для сценария

source: %s: cannot %s %s: %s
ru_ru: %s: невозможно %s %s: %s

source: %s: unrecognized option '%s'
ru_ru: %s: нераспознанная опция '%s'

source: usage: %s [options] [filenames] Available options are: -l list (use -l -l for full listing) -o name output to file 'name' (default is "%s") -p parse only -s strip debug information -v show version information -- stop handling options - stop handling options and process stdin
ru_ru: Использование: %s [опции] [имена файлов] Доступные опции: -l вывести список (используйте -l -l для вывода полного списка) -o имя выходного файла (по умолчанию "%s") -p выполнить только синтаксический анализ -s убрать отладочную информацию -v показать информацию о версии -- прекратить обрабатывать опции - прекратить обрабатывать опции и обработать стандартный поток ввода

source: '-o' needs argument
ru_ru: '-o' необходим аргумент

source: too many input files
ru_ru: слишком много входных файлов

source: no input files given
ru_ru: никакие входные файлы не даны

source: %s: %s precompiled chunk
ru_ru: %s: %s предварительно скомпилированный блок

source: %s size mismatch in
ru_ru: %s несоответствие размера в

source: final position out of string
ru_ru: окончательная позиция вне строки

source: out of range
ru_ru: вне диапазона

source: invalid UTF-8 code
ru_ru: недопустимый UTF-8 код

source: position out of range
ru_ru: позиция вне диапазона

source: initial position is a continuation byte
ru_ru: начальная позиция является последующим байтом

source: '__index' chain too long; possible loop
ru_ru: '__index' цепочка слишком длинная; возможно зацикливание

source: '__newindex' chain too long; possible loop
ru_ru: '__newindex' цепочка слишком длинная; возможно зацикливание

source: string length overflow
ru_ru: переполнение длины строки

source: attempt to divide by zero
ru_ru: попытка деленя на ноль

source: attempt to perform 'n%%0'
ru_ru: попытка выполнить 'n%%0'

source: 'for' limit must be a number
ru_ru: 'for' предел должен быть числом

source: 'for' step must be a number
ru_ru: 'for' шаг должен быть числом

source: 'for' initial value must be a number
ru_ru: 'for' начальное значение должно быть числом
